Repository: CharlesSellers/DigitalOcean-Spaces-Sync
Catalog: languages/dos-*.po
Languages: ru_ru

source: Plugin DigitalOcean Spaces requires PHP 5.3.3 or higher. The plugin has now disabled itself.
ru_ru: Для корректной работы плагина DigitalOcean Spaces необходима версия PHP 5.3.3 или выше. Плагин отключён.

source: Plugin DigitalOcean Spaces requires cURL 7.16.2+. The plugin has now disabled itself.
ru_ru: Для корректной работы плагина DigitalOcean Spaces необходим пакет cURL версии 7.16.2 или выше. Плагин отключён.

source: Connection is successfully established. Save the settings.
ru_ru: Подключение успешно установлено. Сохраните настройки.

source: Connection is not established.
ru_ru: Подключение не установлено.

source: Impossible to upload a file
ru_ru: Невозможно загрузить файл

source: Do not have access to the file
ru_ru: Нет доступа к файлу

source: Unable to connect to the container
ru_ru: Нет подключения к контейнеру

source: Data empty
ru_ru: Нет данных

source: Settings
ru_ru: Настройки

source: Type in your DO Spaces container access information.
ru_ru: Введите ваши данные по DigitalOcean Spaces контейнеру.

source: Don't have an account? <a href="https://goo.gl/SX2UwH">Create it</a>
ru_ru: Ещё нет аккаунта? <a href="https://goo.gl/SX2UwH">Пора его создать!</a>

source: Connection settings
ru_ru: Настройки подключения

source: DO Spaces Container
ru_ru: DO Spaces Контейнер

source: Endpoint
ru_ru: Точка подключения

source: By default
ru_ru: По умолчанию

source: Check the connection
ru_ru: Проверить соединение

source: File & Path settings
ru_ru: Настройки файлов и ссылок

source: Full URL-path to files
ru_ru: Полная ссылка на файлы

source: Enter storage public domain or subdomain if the files are stored only in the cloud storage
ru_ru: Введите публичный адрес (домен или поддомен) вашего контейнера, если файлы будут храниться только в облачном хранилище.

source: or full URL path, if are kept both in cloud and on the server.
ru_ru: или ссылку внутри вашего сервера, если файлы будут храниться сразу в двух местах.

source: In that case duplicates are created. If you change one, you change and the other,
ru_ru: В этом случае данные дублируются. Если вы изменяете один файл, то другой, в облачном хранилище, тоже изменится.

source: Local path
ru_ru: Локальная ссылка

source: Local path to the uploaded files. By default
ru_ru: Локальная ссылка к загруженным файлам. По умолчанию

source: Setting duplicates of the same name from the mediafiles settings. Changing one, you change and other
ru_ru: Настройка дублирует файлы.

source: Storage prefix
ru_ru: Префикс хранилища

source: The path to the file in the storage will appear as a prefix / path.<br />For example, in your case:
ru_ru: Ссылка

source: Filemask
ru_ru: Фильтр файлов

source: for all files, 2 or more values separated by a comma (for example:
ru_ru: для всех файлов, 2 или более значения разделённые запятой (пример:

source: Sync settings
ru_ru: Настройки синхронизации

source: Store files only in the cloud and delete after successful upload.
ru_ru: Хранить файлы только в облачном хранилище.

source: In that case file will be removed from your server after being uploaded to cloud storage, that saves you space.
ru_ru: В этом случае файл будет удалён с вашего сервера после того как будет загружен в облачное хранилище, это сохранит вам место на сервере.

source: Delete file from cloud storage as soon as it was removed from your library.
ru_ru: Удаление файла из облачного хранилища вместе с удалением его из медиа-библиотеки.

source: Deferred file upload.
ru_ru: Отложенная загрузка.

source: File is uploaded with a delay. This protects against errors when uploading large files ( > 50MB).
ru_ru: Файл будет загружен с задержкой. Это защищает от ошибок при загрузке файлов размером больше 50 МБ.

source: Enable debug mode. Do not enable unless you know what it is.
ru_ru: Включить режим отладки. Включайте только если знаете зачем это нужно.

source: This WordPress plugin syncs your media library with DigitalOcean Spaces Container.
ru_ru: Этот плагин синхронизирует вашу медиа библиотеку с DigitalOcean Spaces контейнером.
